Revit 2027 API
UpdaterRegistry.GetRegisteredUpdaterInfos Method
 Returns UpdaterInfos for all the application-wide updaters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<UpdaterInfo> GetRegisteredUpdaterInfos()
Public Shared Function GetRegisteredUpdaterInfos As IList(Of UpdaterInfo)
public:
static IList<UpdaterInfo^>^ GetRegisteredUpdaterInfos()
static member GetRegisteredUpdaterInfos : unit -> IList<UpdaterInfo>
Return Value
IList<UpdaterInfo>
 List of UpdaterInfo structures
See Also
Reference
UpdaterRegistry Class
GetRegisteredUpdaterInfos Overload
Autodesk.Revit.DB Namespace